
//public class Lotto {
//
//	public static void main(String[] args) {
//
//		// 로또 번호 추출기 만들기
//		
//		// 0. 6개의 숫자를 저장할 배열 만들기
//		
//		int [] lo1;
//		lo1 = new int[6];
//		
//		// int [] lo2 = new int[6];
//		
//		
//		// 1. 6개의 숫자 뽑기 ( 조검 : 1 ~ 45, Random, 중복X ) + 배열에 저장
//		for ( int i = 0; i < lo1.length; i++) {
//			lo1[i] = (int)(Math.random() * 45) + 1; // 1~45
//		}
//		for ( int i = 0; i < lo1.length; i++) {
//			System.out.printf("lo1[%d] = %d\n", i, lo1[i]);
//		}
//		// 2. 뽑힌 숫자의 평균 계산
//		
//		// -------------------------------------------------------------
//		
//		// 3. 평균이 20~26 범위를 벗어나면 1부터 다시
//		
//		// 4. 뽑힌 숫자 출력
//		
//		// 5. 사용자가 언할 떄까지 반복 ( 메뉴 시스템으로 구현 )
//	}
//
//}
